{
    "timestamp": "2025-02-25T06:06:31.050785",
    "articles": [
        {
            "title": "iOS 18.4 beta 1: Here’s everything new",
            "summary": "Apple has released the first developer beta of iOS 18.4. While it’s missing some of the most impressive Apple Intelligence features, it includes a ton of other new features and changes. Head below for our full roundup of everything new in iOS 18.4… iOS 18.4 beta 1 is available now to developer beta testers.",
            "link": "https://9to5mac.com/2025/02/21/ios-18-4-beta-1-heres-everything-new/"
        },
        {
            "title": "Jony Ive talks about Apple and Steve Jobs in new BBC interview",
            "summary": "It’s been a long time since Jony Ive left Apple to found his own design firm, but his work in technology will never be forgotten. Last weekend, Ive talked to the BBC’s Desert Island Discs about his experience working on big projects at Apple and remembered his relationship with Steve Jobs. According to Ive, it’s hard not to think “what Steve would do” even though Jobs himself told the designer that he shouldn’t do it.",
            "link": "https://9to5mac.com/2025/02/24/jony-ive-apple-jobs-bbc/"
        },
        {
            "title": "Phil Schiller had ‘great concerns’ about charging developers for external purchases",
            "summary": "A lot of things have changed in the App Store over the last year. For instance, the company had to allow sideloading in the EU, while it also changed its guidelines to let developers link to external payment methods – as long as they still pay Apple a commission. But according to Apple Fellow Phil Schiller, he raised concerns about this idea at the time.",
            "link": "https://9to5mac.com/phil-schiller-had-great-concerns-about-charging-developers-for-external-purchases/"
        },
        {
            "title": "iOS 18.4 gives Apple’s Passwords app a small but convenient new feature",
            "summary": "iOS 18.4 beta 1 is now available, including for public beta users. And among its many changes, there’s a convenient feature enhancement to verification codes found in Apple’s Passwords app. Here are the details.",
            "link": "https://9to5mac.com/2025/02/24/ios-184-apple-passwords-small-convenient-new-feature/"
        },
        {
            "title": "MagSafe Monday: Creativity meets function with the MOFT Action Inspiration",
            "summary": "So many accessories for MagSafe revolve around charging, docking, etc. Some of them are not technology-related but work with an analog approach. The MOFT Action Inspiration is an awesome product for those who love sticky notes but need something on the go.",
            "link": "https://9to5mac.com/2025/02/24/creativity-meets-function-with-the-moft-action-inspiration/"
        },
        {
            "title": "macOS 15.4, iPadOS 18.4, and more public betas arrive, here’s what’s new",
            "summary": "Apple has just released new public betas for its various software platforms, including macOS Sequoia 15.4, iPadOS 18.4, tvOS 18.4, and more. Here are the new features to expect. To install the new software, you have to first be enrolled in Apple’s beta software program.",
            "link": "https://9to5mac.com/2025/02/24/macos-154-and-more-public-betas-arrive-heres-whats-new/"
        },
        {
            "title": "iOS 18.4 public beta now available, here’s everything new",
            "summary": "iOS 18.3 launched almost a month ago, leaving a long gap afterward with no new software. But the first iOS 18.4 public beta is finally here, and it brings a lot of big and small changes for iPhone. Here’s what’s new in today’s release.",
            "link": "https://9to5mac.com/2025/02/24/ios-184-public-beta-now-available-heres-everything-new/"
        },
        {
            "title": "Runtime 004: What happens next for Ai Pin after HP buys Humane?",
            "summary": "This week Sophia and Zac go behind-the-scenes on what happened at Humane, what the future could hold for the Ai Pin, and a quick look back at Apple’s iPhone 16e announcement. Sophia Tung Zac Hall FTC: We use income earning auto affiliate links. More.",
            "link": "https://9to5mac.com/2025/02/24/runtime-004-what-happens-next-for-ai-pin-after-hp-buys-humane/"
        },
        {
            "title": "Gemini app for iPhone gets homescreen redesign, auto-opens keyboard",
            "summary": "Following Android in January, the Gemini app on iPhone has received a homescreen redesign that will auto-open the keyboard on launch. The “Ask Gemini” field now extends the entire width of the screen, while Google has removed the microphone and camera icon pill. At the right, it’s just buttons for voice input and Gemini Live.",
            "link": "https://9to5google.com/2025/02/24/gemini-iphone-redesign/"
        },
        {
            "title": "Deals: M4 iPad Pro $250 off, Apple Pencil Pro nearly 25% off, Apple Home Key Lock $90, M3 MacBook Air, more",
            "summary": "Alongside ongoing price drops on the popular M4 Mac mini configurations, today we spotted the return of $150 discounts on the mid-range 512GB M4 iPad Pro models as well as up to $250 off the higher-end variants. Those join ongoing offers on the M3 MacBook Air lineup with select models dropping even lower at up to $417 off the original prices as well as the return of Apple Pencil Pro at nearly 25% off and a deep 40% discount on this Apple Home Key Smart Lock. Everything else awaits down below.",
            "link": "https://9to5mac.com/2025/02/24/deals-m4-ipad-pro-apple-pencil-pro-apple-home-key/"
        },
        {
            "title": "Apple Intelligence is now fully supported in the EU with iOS 18.4",
            "summary": "iOS 18.4 includes a variety of big and small upgrades for iPhone users, but if you’re in the EU, there’s one especially huge change in the first beta: Apple Intelligence is now fully supported for EU users. Not long after Apple first debuted its initial Apple Intelligence feature set at WWDC last June, the company shared some bad news: AI wouldn’t be supported in the EU at launch, or until further notice. The reason? Certain EU regulations the company needed to navigate.",
            "link": "https://9to5mac.com/2025/02/24/apple-intelligence-is-now-fully-supported-in-the-eu-with-ios-18-4/"
        },
        {
            "title": "iOS 18.4 beta 1 – 50 new changes and features [Video]",
            "summary": "In this latest episode of iOS Decoded, 9to5Mac investigates everything new in iOS 18.4, including several new behind-the-scenes features that you may be hearing about for the first time. Included in our walkthrough is a full hands-on look at the new proximity setup feature for Mac, Prioritize notifications, the new Ambient Music feature, and much, much more. Subscribe to 9to5Mac on YouTube for additional iOS 18.4 coverage.",
            "link": "https://9to5mac.com/2025/02/24/ios-18-4-beta-1-50-new-changes-and-features-video/"
        },
        {
            "title": "HomeKit Weekly: Meross launches new Matter enabled smart thermostat",
            "summary": "Smart thermostats are one of the best ways to elevate your home’s energy efficiency while staying comfortable year-round and gaining access to some great automations. Meross has just released a Matter-enabled smart thermostat that promises broad compatibility across major smart home platforms, including Apple HomeKit. Here’s why the new Meross thermostat is a great option for HomeKit fans.",
            "link": "https://9to5mac.com/2025/02/24/meross-thermostat/"
        },
        {
            "title": "Gurman: Foldable iPhone and ‘another new iPhone design’ coming in 2026",
            "summary": "The iPhone 16e just launched, but Apple has four more iPhone models launching this fall—including the ultra-thin iPhone 17 Air. But per Mark Gurman, 2026 may be even bigger for the iPhone thanks to two brand new designs in the works: a foldable and another mysterious new design. This weekend in his Power On newsletter, Mark Gurman detailed Apple’s current iPhone plans for this year and next.",
            "link": "https://9to5mac.com/2025/02/24/gurman-foldable-iphone-and-another-new-iphone-design-coming-in-2026/"
        },
        {
            "title": "New AirTag 2 leak reveals when to expect product launch",
            "summary": "Apple launched its first product of the year last week—the iPhone 16e—but five more product launches are expected in the coming weeks and months. One such device is the long-awaited AirTag 2. Now, thanks to a new leak, we have a better idea than ever of when to expect it.",
            "link": "https://9to5mac.com/2025/02/24/new-airtag-2-leak-reveals-when-to-expect-product-launch/"
        },
        {
            "title": "Meta community notes open to contributors, as Musk threatens to ‘fix’ them on X",
            "summary": "Meta community notes are expected to launch within the next couple of months, after the social network announced it would be ending its own fact-checking program because facts are so 2015. You can now apply to be a contributor to these, signing up on one of Facebook, Instagram, and Threads. Meantime, X owner Elon Musk appears to be threatening the impartiality of his platform’s community notes, announcing plans to “fix” the feature … Back in the halcyon days when people cared about whether a claim was true or false, social networks employed professional researchers whose job was to verify claims made on their platforms in order to prevent the spread of misinformation.",
            "link": "https://9to5mac.com/2025/02/24/meta-community-open-to-contributors-as-musk-threatens-to-fix-them-on-x/"
        },
        {
            "title": "Here’s the complete iPhone 17 line-up according to three high-profile leakers",
            "summary": "While there have been some differences of opinion between leakers in the past, three high-profile ones have all endorsed the same CAD drawing of the complete iPhone 17 line-up. The drawing shows the three completely different camera layouts expected for the base iPhone 17, the iPhone 17 Air, and the two iPhone 17 Pro models … Majin Bu has been the source of a number of accurate leaks in the past, most recently the naming of the iPhone 16e. Bu was the first to report this, in early January.",
            "link": "https://9to5mac.com/2025/02/24/heres-the-complete-iphone-17-line-up-according-to-three-high-profile-leakers/"
        },
        {
            "title": "Apple made this change to avoid appearing to approve iPhone porn apps",
            "summary": "A technicality had previously given the impression that Apple approved of a porn app being made available to iPhone users in the EU via a third-party app store. That lead to some misleading headlines, but Apple has now solved the problem by changing three words in the email sent to developers … The EU’s Digital Markets Act (DMA) last year required Apple to allow third-party app stores on the iPhone, and the company begrudgingly complied – though did its best to deter iPhone owners from using them, and made the installation process as clunky as possible. One of Apple’s stated objections was that it would no longer be able to keep certain types of apps off the platform, with pornography one of the categories the company has always rejected.",
            "link": "https://9to5mac.com/2025/02/24/apple-made-this-change-to-avoid-appearing-to-approve-iphone-porn-apps/"
        },
        {
            "title": "As Trump tariffs loom, Apple pledges more than $500bn in US investment, new Texas factory",
            "summary": "Apple has today announced that it is committed to invest more than $500 billion in the United States over the next four years, including 20,000 U.S. jobs and a new factory in Houston, Texas. The $500 billion headline figure is not all new, with much of what is promised in the announcement having been pledged before.",
            "link": "https://9to5mac.com/2025/02/24/apple-us-investment-trump-tariffs/"
        },
        {
            "title": "You can now use AirPods Pro as hearing aids in the UK",
            "summary": "As previously reported in January, the AirPods Pro 2 can now be used as hearing aids in the United Kingdom, having now received government approval for over-the-counter hearing aid devices. AirPods Pro 2 can address mild to moderate hearing loss. With an iPhone and AirPods Pro, users can perform a hearing test, and apply their hearing profile to their earbuds for continuous hearing correction.",
            "link": "https://9to5mac.com/2025/02/24/airpods-pro-hearing-aid-uk/"
        },
        {
            "title": "Apple just fixed one of CarPlay’s biggest usability issues",
            "summary": "Apple released iOS 18.4 beta on Friday, with a number of unique new features. Some of the new features include Priority Notifications with Apple Intelligence, a new Food section in the Apple News app, and more. However, there was another smaller change that went under the radar, one that has to do with CarPlay – particularly on larger displays.",
            "link": "https://9to5mac.com/2025/02/23/apple-fixed-carplay-usability-large-displays-ios-18-4/"
        },
        {
            "title": "iOS 18.4 beta finally enables ‘Find My’ support in South Korea",
            "summary": "Last July, citizens of South Korea started a petition asking Apple to enable Find My support in the region. It was assumed that Find My was unavailable due to government restrictions, but that wasn’t actually the case according to the petition. Apple later agreed to launch Find My support for the region in spring 2025, and that integration is finally starting to roll out.",
            "link": "https://9to5mac.com/2025/02/23/ios-18-4-find-my-support-south-korea/"
        },
        {
            "title": "Apple Watch spring 2025 shopping guide: Series 10, Ultra 2, SE, and more",
            "summary": "Shopping for an Apple Watch and don’t know where to start? Look no further than our Apple Watch spring 2025 shopping guide as we take you through every option, key differences, and buying tips. Buyer’s note: Shop Apple on Amazon for discounted prices that you can’t find directly from Apple. Apple Watch Series 10 is the newest Apple Watch.",
            "link": "https://9to5mac.com/apple-watch-2024-buyers-guide-series-10-ultra-2-se/"
        },
        {
            "title": "These are my favorite unique charging accessories for your Apple ecosystem",
            "summary": "If you take a look at the current landscape of charging accessories in 2025, it seems like everyone is doing the same thing. Every brand has its flagship 3 in 1 charger or a 140W wall charger, or a Magsafe charging brick. So what I wanted to do is highlight some products that have brought some unique twists to a product category that seems to have been stale.",
            "link": "https://9to5mac.com/2025/02/23/these-are-my-favorite-unique-charging-accessories-for-your-apple-ecosystem/"
        },
        {
            "title": "iPhone charging slowly? How to fast charge iPhone 16",
            "summary": "Modern phones, like the iPhone 16, have a large internal battery capacity. Recharging that battery can take about four hours, if using the slowest available charging methods. In best conditions, though, you can fast charge your iPhone from empty to 50% in 30 minutes, with a full 100% charge in about 2 hours.",
            "link": "https://9to5mac.com/iphone-charging-slowly-how-to-fast-charge-iphone-16/"
        }
    ]
}